# Host: localhost  (Version 5.7.10-log)
# Date: 2016-05-14 14:52:53
# Generator: MySQL-Front 5.3  (Build 5.31)

/*!40101 SET NAMES utf8 */;

#
# Structure for table "questions"
#

DROP TABLE IF EXISTS `questions`;
CREATE TABLE `questions` (
  `id_question` int(11) NOT NULL AUTO_INCREMENT,
  `question` mediumtext,
  `answer_1` text,
  `answer_2` text,
  `answer_3` text,
  `answer_4` text,
  PRIMARY KEY (`id_question`)
) ENGINE=InnoDB AUTO_INCREMENT=21 DEFAULT CHARSET=utf8;

#
# Data for table "questions"
#

INSERT INTO `questions` VALUES (1,'14. Яку б країну Ви хотіли б відвідати в першу чергу:\n','- США','- Францію','- Італію','- Швейцарію'),(2,'- спокійні (зелений, блакитний, коричневий ..) \n','- потужний комп’ютер, ноутбук','- брендовий одяг','- витратив би на шикарну вечірку','- покладу кошти на депозит'),(3,'12.  На що б ви витратили свою першу зарплату?','- На вечірку з друзями  ','- Оновлю гардероб','- Відкладу на власну справу','- Куплю те, про що давно мрію'),(4,'11. У яких компаніях чи організаціях ви б хотіли працювати?','- Coca Cola ','- Google','- В одному з банків Швейцарії ','- В одному з Модних будинків Парижу'),(5,'10. За якими критеріями ви б обирали свою майбутню роботу?','- Рівень заробітку','- Офіційне працевлаштування','- Можливість для креативу, відсутність рутини','- Репутація компанії, дружній колектив'),(6,'9. Однією з моїх найкращих рис характеру є:','- креативність, життєрадісність','- організаторські здібності','- ретельність та уважність','- працьовитість '),(7,'8. Який шкільний предмет Ви полюбляли найбільше?','- малювання','- математика ','- інформатика ','- географія '),(8,'7. Ким ви мріяли стати в дитинстві?','- президентом ','- директором компанії ','- актором чи артистом','- ким я тільки не хотів стати! '),(9,'6. Як Вам найкраще сприймати інформацію?','- з розповідей, на слух ','- візуально (люблю ілюстрації)','- спілкування з друзями ','- з Інтернету, книг, довідників '),(10,'5. Найкращий спосіб обрати професію – це:','- порадитися з досвідченими, знаючими людьми','- за велінням душі','- дізнатися, хто найбільш затребуваний на ринку ','- пройти тестування'),(11,'4. Який режим роботи Вас би влаштував в майбутньому?','- Легко підлаштуюсь під будь-який графік','- вільний/гнучкий графік роботи','- стабільний режим – 5 робочих днів/2 вихідні','- якщо робота улюблена, нею можна займатись весь час'),(12,'3. Які кольори Вам до вподоби?','- все одно, головне, щоб очі не різало ','- будь-які яскраві та насичені','- контрастні, наприклад, білий-чорний','- спокійні (зелений, блакитний, коричневий ..) '),(13,'2. При оцінці професії Ви вважаєте найголовнішим те, наскільки вона:','- важлива для суспільства ','- цікава особисто Вам','- стабільна та престижна ','- добре оплачується '),(14,'1. Найкраще проведення вільного часу для Вас – це:','- спілкування з друзями ','- вивчення чогось нового ','- прогулянка на природі ','- подорожування'),(15,'15. В якій галузі у вас є досвід роботи:','- Соціологна ','- Економічна ','-Іноформаційно-технічна ','-Гуманітарна'),(16,'16. Рівень володіння англійською мовою ','- Beginner ','- Elementary ','-Upper-Intermediate ','-Advanced '),(17,'17.Рівень володіння помп’ютером','-базовий','-Впевнений користувач Пк ','-досвідчений користувач пк ','-мастер '),(18,'18. Який напрямок IT вам подобається:','-Менеджмент','-Програмування','-Бізнес-аналітика','-дизайн'),(19,'19. Чи є у вас досвід роботи з: ','-Мовами програмування ','-Графічними редакторами ','-1С ','-Системною інтеграцією'),(20,'20.У вас добре виходить: ','-Генерувати нові ідеї ','-нестандартно мислити ','-Вирішувати типові завдання ','-Знаходити контакт з людьми');

#
# Structure for table "answers"
#

DROP TABLE IF EXISTS `answers`;
CREATE TABLE `answers` (
  `Id` int(11) NOT NULL AUTO_INCREMENT,
  `id_question` int(11) NOT NULL DEFAULT '0',
  `develop` tinyint(3) NOT NULL DEFAULT '0',
  `desing` tinyint(3) NOT NULL DEFAULT '0',
  `economy` tinyint(3) NOT NULL DEFAULT '0',
  `marketing` tinyint(3) NOT NULL DEFAULT '0',
  `bo` tinyint(3) NOT NULL DEFAULT '0',
  `comp` tinyint(3) NOT NULL DEFAULT '0',
  PRIMARY KEY (`Id`),
  KEY `id_question` (`id_question`),
  CONSTRAINT `answers_ibfk_1` FOREIGN KEY (`id_question`) REFERENCES `questions` (`id_question`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=82 DEFAULT CHARSET=utf8;

#
# Data for table "answers"
#

INSERT INTO `answers` VALUES (1,1,0,0,0,1,0,0),(2,1,1,0,0,0,0,1),(3,1,0,1,1,0,1,0),(4,1,0,1,0,1,0,0),(5,2,0,0,1,1,1,0),(6,2,1,1,0,0,0,1),(7,2,0,0,1,1,1,0),(8,2,1,0,0,0,0,1),(9,3,1,0,1,0,1,1),(10,3,0,1,0,1,0,0),(11,3,0,0,1,0,1,0),(12,3,0,0,1,1,1,0),(13,4,0,1,0,1,0,0),(14,4,1,1,0,0,0,1),(15,4,0,1,1,0,1,0),(16,4,1,1,0,0,0,0),(17,5,1,0,1,0,1,0),(18,5,1,1,0,0,0,0),(19,5,0,0,1,1,1,0),(20,5,1,0,1,0,1,1),(21,6,1,0,0,1,0,0),(22,6,0,1,0,0,0,0),(23,6,0,0,1,0,1,1),(24,6,1,0,1,0,0,1),(25,7,1,0,1,0,1,0),(26,7,0,0,0,1,0,0),(27,7,0,1,0,0,0,0),(28,7,1,0,0,0,0,1),(29,8,0,1,0,0,0,0),(30,8,1,0,1,0,1,1),(31,8,1,0,0,0,0,0),(32,8,0,0,0,1,1,0),(33,9,0,1,0,0,0,1),(34,9,0,0,0,1,0,0),(35,9,1,0,0,0,1,1),(36,9,1,0,1,0,1,1),(37,10,1,0,0,1,0,1),(38,10,0,0,1,1,1,0),(39,10,0,1,0,1,0,0),(40,10,0,0,0,1,1,0),(41,11,0,1,0,1,0,0),(42,11,1,0,0,1,0,1),(43,11,0,0,1,0,1,0),(44,11,0,1,0,0,0,0),(45,12,0,0,0,1,0,0),(46,12,0,1,0,0,0,0),(47,12,0,0,1,0,1,0),(48,12,1,0,0,0,0,1),(49,13,1,0,1,0,0,1),(50,13,0,1,0,1,0,0),(51,13,0,1,0,1,0,0),(52,13,0,0,1,0,1,0),(53,14,1,0,0,1,0,1),(54,14,0,1,0,0,0,0),(55,14,0,0,0,1,1,0),(56,14,0,0,1,0,1,0),(57,15,1,0,1,0,0,0),(58,15,0,0,1,0,1,0),(59,15,1,0,0,0,1,1),(60,15,0,0,0,1,0,0),(61,16,0,0,1,0,1,1),(62,16,1,1,0,1,0,0),(63,16,1,1,0,0,0,0),(64,16,1,0,0,1,0,0),(65,17,0,0,1,1,1,0),(66,17,0,1,0,1,0,0),(67,17,1,1,0,0,0,1),(68,17,1,0,0,0,0,0),(69,18,0,0,0,1,0,0),(70,18,1,0,0,0,0,0),(71,18,0,0,1,0,1,0),(72,18,0,1,0,0,0,0),(73,19,1,0,0,0,0,0),(74,19,0,1,0,0,0,0),(75,19,0,0,1,0,1,0),(76,19,0,0,0,1,0,1),(77,20,1,1,0,0,0,0),(78,20,1,1,0,1,0,1),(79,20,0,0,1,0,1,1),(80,20,0,0,0,1,0,0);

#
# Structure for table "user"
#

DROP TABLE IF EXISTS `user`;
CREATE TABLE `user` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `email` varchar(255) DEFAULT NULL,
  `firstName` varchar(255) DEFAULT NULL,
  `lastName` varchar(255) DEFAULT NULL,
  `pass` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8;

#
# Data for table "user"
#

INSERT INTO `user` VALUES (1,'132','3','123','321321');

#
# Structure for table "users"
#

DROP TABLE IF EXISTS `users`;
CREATE TABLE `users` (
  `Id` int(11) NOT NULL AUTO_INCREMENT,
  `id_user` varchar(255) DEFAULT NULL,
  `ip_user` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`Id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

#
# Data for table "users"
#

